# Sakila Star Schema & ETL  

All the database tables in this notebook are based on public database samples and transformations
- `Sakila` is a sample database created by `MySql` [Link](https://dev.mysql.com/doc/sakila/en/sakila-structure.html)
- The postgresql version of it is called `Pagila` [Link](https://github.com/devrimgunduz/pagila)
- The facts and dimension tables design is based on O'Reilly's public dimensional modelling tutorial schema [Link](https://video.udacity-data.com/topher/2021/August/61120d38_pagila-star/pagila-star.png)

This notebook uses the `ipython-sql` extension to run SQL directly from Jupyter cells.

- To execute SQL queries we write one of the following atop of the cell: 
    - `%sql`
        - For a one-liner SQL query
        - We can access a python var using `$`    
    - `%%sql`
        - For a multi-line SQL query
        - We can **NOT** access a python var using `$`

# 1. Connection to the database

After download the Pagila database from  [Link](https://github.com/devrimgunduz/pagila), we create it locally, and then accessed via the notebookâ€™s SQL magic commands, as shown in the cells below.

In [1]:
%load_ext sql

In [ ]:
import os
from dotenv import load_dotenv

# 1) Load the .env into os.environ
load_dotenv()  

# 2) Grab the full URL with credentials to connect to the database:
#    The URL should be in the format:
#    postgresql://<username>:<password>@<host>:<port>/<database>

conn_string = os.getenv("DATABASE_URL")
if not conn_string:
    raise RuntimeError("ðŸ”’  DATABASE_URL not found â€“ did you create your .env next to the notebook?")

In [3]:
%sql $conn_string

In [4]:
%%sql
SELECT current_database() AS db, current_user AS user;

 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.

[('pagila', 'postgres')]

In [5]:
%sql --connections

{'postgresql://postgres:***@localhost:5432/pagila': <sql.connection.Connection at 0x105f9ba00>}

# 2. Exploration of the  3NF Schema

The Sakila Database has a 3NF Schema

<img src="pagila-3nf.png" width="70%"/>

## 2.1 How much? What data sizes are we looking at?

In [26]:
nStores = %sql select count(*) from store;
nFilms = %sql select count(*) from film;
nCustomers = %sql select count(*) from customer;
nRentals = %sql select count(*) from rental;
nPayment = %sql select count(*) from payment;
nStaff = %sql select count(*) from staff;
nCity = %sql select count(*) from city;
nCountry = %sql select count(*) from country;

print("nFilms\t\t=", nFilms[0][0])
print("nCustomers\t=", nCustomers[0][0])
print("nRentals\t=", nRentals[0][0])
print("nPayment\t=", nPayment[0][0])
print("nStaff\t\t=", nStaff[0][0])
print("nStores\t\t=", nStores[0][0])
print("nCities\t\t=", nCity[0][0])
print("nCountry\t\t=", nCountry[0][0])

 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
nFilms		= 1000
nCustomers	= 599
nRentals	= 16044
nPayment	= 16049
nStaff		= 1500
nStores		= 500
nCities		= 600
nCountry		= 109

## 2.2 When? What time period are we talking about?

In [27]:
%%sql 
select min(payment_date) as start, max(payment_date) as end from payment;

 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.

[(datetime.datetime(2022, 1, 23, 7, 3, 52, 212496, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800))), datetime.datetime(2022, 7, 27, 5, 39, 20, 739759, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=68400))))]

## 2.3 Where? Where do events in this database occur?

In [28]:
%%sql
SELECT district,  COUNT(address) as n
FROM address
GROUP BY district
ORDER BY n desc
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/pagila
10 rows affected.

[('Buenos Aires', 10),
 ('Shandong', 9),
 ('California', 9),
 ('West Bengali', 9),
 ('Uttar Pradesh', 8),
 ('So Paulo', 8),
 ('England', 7),
 ('Maharashtra', 7),
 ('Southern Tagalog', 6),
 ('Gois', 5)]

# 3. Data analysis

## 3.1 Insight 1:   Top Grossing Movies 
- Payments amounts are in table `payment`
- Movies are in table `film`
- They are not directly linked, `payment` refers to a `rental`, `rental` refers to an `inventory` item and `inventory` item refers to a `film`
- `payment` &rarr; `rental` &rarr; `inventory` &rarr; `film`

### 3.1.1 Films

In [29]:
%%sql
select film_id, title, release_year, rental_rate, rating  from film limit 5;

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.

[(1, 'ACADEMY DINOSAUR', 2012, Decimal('0.99'), 'PG'),
 (2, 'ACE GOLDFINGER', 2023, Decimal('4.99'), 'G'),
 (3, 'ADAPTATION HOLES', 2017, Decimal('2.99'), 'NC-17'),
 (4, 'AFFAIR PREJUDICE', 2023, Decimal('2.99'), 'G'),
 (5, 'AFRICAN EGG', 2019, Decimal('2.99'), 'G')]

### 3.1.2 Payments

In [30]:
%%sql
select * from payment limit 5;

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.

[(16051, 269, 1, 98, Decimal('0.99'), datetime.datetime(2022, 1, 28, 19, 58, 52, 222594, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800)))),
 (16065, 274, 1, 147, Decimal('2.99'), datetime.datetime(2022, 1, 25, 6, 14, 16, 895377, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800)))),
 (16109, 297, 2, 143, Decimal('0.99'), datetime.datetime(2022, 1, 27, 18, 49, 49, 128218, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800)))),
 (16195, 344, 2, 157, Decimal('2.99'), datetime.datetime(2022, 1, 30, 23, 58, 51, 176578, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800)))),
 (16202, 348, 2, 821, Decimal('0.99'), datetime.datetime(2022, 1, 26, 10, 52, 41, 359433, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800))))]

### 3.1.3 Inventory

In [31]:
%%sql
select * from inventory limit 5;

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.

[(1, 1, 1, datetime.datetime(2022, 2, 15, 4, 9, 17, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800)))),
 (2, 1, 1, datetime.datetime(2022, 2, 15, 4, 9, 17, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800)))),
 (3, 1, 1, datetime.datetime(2022, 2, 15, 4, 9, 17, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800)))),
 (4, 1, 1, datetime.datetime(2022, 2, 15, 4, 9, 17, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800)))),
 (5, 1, 2, datetime.datetime(2022, 2, 15, 4, 9, 17, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800))))]

### 3.1.4 Get the movie of every payment

In [32]:
%%sql
SELECT f.title, p.amount, p.payment_date, p.customer_id                                            
FROM payment p
JOIN rental r    ON ( p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id )
JOIN film f ON ( i.film_id = f.film_id)
limit 5;

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.

[('PACKER MADIGAN', Decimal('0.99'), datetime.datetime(2022, 1, 28, 19, 58, 52, 222594, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800))), 269),
 ('CHARIOTS CONSPIRACY', Decimal('2.99'), datetime.datetime(2022, 1, 25, 6, 14, 16, 895377, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800))), 274),
 ('CRAFT OUTFIELD', Decimal('0.99'), datetime.datetime(2022, 1, 27, 18, 49, 49, 128218, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800))), 297),
 ('CRUSADE HONEY', Decimal('2.99'), datetime.datetime(2022, 1, 30, 23, 58, 51, 176578, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800))), 344),
 ('ROMAN PUNK', Decimal('0.99'), datetime.datetime(2022, 1, 26, 10, 52, 41, 359433, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800))), 348)]

### 3.1.5 sum movie rental revenue

In [33]:
%%sql
SELECT f.title, sum(p.amount) as revenue                                            
FROM payment p
JOIN rental r    ON ( p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id )
JOIN film f ON ( i.film_id = f.film_id)
GROUP BY title
ORDER BY revenue desc
limit 10;

 * postgresql://postgres:***@localhost:5432/pagila
10 rows affected.

[('TELEGRAPH VOYAGE', Decimal('231.73')),
 ('WIFE TURN', Decimal('223.69')),
 ('ZORRO ARK', Decimal('214.69')),
 ('GOODFELLAS SALUTE', Decimal('209.69')),
 ('SATURDAY LAMBS', Decimal('204.72')),
 ('TITANS JERK', Decimal('201.71')),
 ('TORQUE BOUND', Decimal('198.72')),
 ('HARRY IDAHO', Decimal('195.70')),
 ('INNOCENT USUAL', Decimal('191.74')),
 ('HUSTLER PARTY', Decimal('190.78'))]

## 3.2 Insight 2:   Top grossing cities 
- Payments amounts are in table `payment`
- Cities are in table `cities`
- `payment` &rarr; `customer` &rarr; `address` &rarr; `city`

### 3.2.1 Get the city of each payment

In [36]:
%%sql
SELECT p.customer_id, p.rental_id, p.amount, ci.city                            
FROM payment p
JOIN customer c  ON ( p.customer_id = c.customer_id )
JOIN address a ON ( c.address_id = a.address_id )
JOIN city ci ON ( a.city_id = ci.city_id )
order by p.payment_date
limit 10;

 * postgresql://postgres:***@localhost:5432/pagila
10 rows affected.

[(427, 8182, Decimal('3.99'), 'Guaruj'),
 (180, 2798, Decimal('2.99'), 'Pereira'),
 (426, 10172, Decimal('10.99'), 'Purnea (Purnia)'),
 (295, 2054, Decimal('2.99'), 'Kolpino'),
 (172, 1507, Decimal('0.99'), 'Batman'),
 (277, 6487, Decimal('5.99'), 'Ogbomosho'),
 (2, 8705, Decimal('5.99'), 'San Bernardino'),
 (108, 4082, Decimal('2.99'), 'Huixquilucan'),
 (141, 13470, Decimal('4.99'), 'Fukuyama'),
 (43, 8376, Decimal('4.99'), 'Faaa')]

### 3.2.2 Top grossing cities

In [37]:
%%sql
SELECT ci.city ,  sum(p.amount) as revenue
FROM payment p
JOIN customer c  ON ( p.customer_id = c.customer_id )
JOIN address a ON ( c.address_id = a.address_id )
JOIN city ci ON ( a.city_id = ci.city_id )
group by ci.city
order by revenue desc
limit 10;

 * postgresql://postgres:***@localhost:5432/pagila
10 rows affected.

[('Cape Coral', Decimal('221.55')),
 ('Saint-Denis', Decimal('216.54')),
 ('Aurora', Decimal('198.50')),
 ('Molodetno', Decimal('195.58')),
 ('Santa Brbara dOeste', Decimal('194.61')),
 ('Apeldoorn', Decimal('194.61')),
 ('Qomsheh', Decimal('186.62')),
 ('London', Decimal('180.52')),
 ('Ourense (Orense)', Decimal('177.60')),
 ('Bijapur', Decimal('175.61'))]

## 3.3 Insight 3 : Revenue of a movie by customer city and by month

### 3.3.1 Total revenue by month

In [38]:
%%sql
SELECT sum(p.amount) as revenue, EXTRACT(month FROM p.payment_date) as month
from payment p
group by month
order by revenue desc
limit 10;

 * postgresql://postgres:***@localhost:5432/pagila
7 rows affected.

[(Decimal('11383.93'), Decimal('3')),
 (Decimal('11313.33'), Decimal('5')),
 (Decimal('10929.45'), Decimal('6')),
 (Decimal('10770.52'), Decimal('4')),
 (Decimal('10179.94'), Decimal('2')),
 (Decimal('9641.82'), Decimal('7')),
 (Decimal('3197.52'), Decimal('1'))]

### 3.3.2 Each movie by customer city and by month (data cube)

In [39]:
%%sql
SELECT f.title, p.amount, p.customer_id, ci.city, p.payment_date,EXTRACT(month FROM p.payment_date) as month
FROM payment p
JOIN rental r    ON ( p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id )
JOIN film f ON ( i.film_id = f.film_id)
JOIN customer c  ON ( p.customer_id = c.customer_id )
JOIN address a ON ( c.address_id = a.address_id )
JOIN city ci ON ( a.city_id = ci.city_id )
order by p.payment_date
limit 10;

 * postgresql://postgres:***@localhost:5432/pagila
10 rows affected.

[('TOMORROW HUSTLER', Decimal('3.99'), 427, 'Guaruj', datetime.datetime(2022, 1, 23, 7, 3, 52, 212496, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800))), Decimal('1')),
 ('EXPRESS LONELY', Decimal('2.99'), 180, 'Pereira', datetime.datetime(2022, 1, 23, 7, 24, 17, 906429, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800))), Decimal('1')),
 ('MAIDEN HOME', Decimal('10.99'), 426, 'Purnea (Purnia)', datetime.datetime(2022, 1, 23, 7, 42, 35, 952907, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800))), Decimal('1')),
 ('GANDHI KWAI', Decimal('2.99'), 295, 'Kolpino', datetime.datetime(2022, 1, 23, 7, 43, 42, 505434, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800))), Decimal('1')),
 ('MAJESTIC FLOATS', Decimal('0.99'), 172, 'Batman', datetime.datetime(2022, 1, 23, 7, 57, 4, 87741, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800))), Decimal('1')),
 ('SWEDEN SHINING', Decimal('5.99'), 277, 'Ogbomosho', datetime.datetime(2022, 1, 23, 8, 5, 24, 118128, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800))), Decimal('1')),
 ('TELEGRAPH VOYAGE', Decimal('5.99'), 2, 'San Bernardino', datetime.datetime(2022, 1, 23, 8, 26, 35, 170413, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800))), Decimal('1')),
 ('OPERATION OPERATION', Decimal('2.99'), 108, 'Huixquilucan', datetime.datetime(2022, 1, 23, 8, 44, 27, 976362, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800))), Decimal('1')),
 ('PINOCCHIO SIMON', Decimal('4.99'), 141, 'Fukuyama', datetime.datetime(2022, 1, 23, 9, 6, 30, 830136, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800))), Decimal('1')),
 ('SHAWSHANK BUBBLE', Decimal('4.99'), 43, 'Faaa', datetime.datetime(2022, 1, 23, 9, 16, 12, 762605, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800))), Decimal('1'))]

### 3.3.3 Sum of revenue of each movie by customer city and by month

In [40]:
%%sql
SELECT f.title, ci.city,EXTRACT(month FROM p.payment_date) as month, sum(p.amount) as revenue
FROM payment p
JOIN rental r    ON ( p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id )
JOIN film f ON ( i.film_id = f.film_id)
JOIN customer c  ON ( p.customer_id = c.customer_id )
JOIN address a ON ( c.address_id = a.address_id )
JOIN city ci ON ( a.city_id = ci.city_id )
group by (f.title, ci.city, month)
order by month, revenue desc
limit 10;

 * postgresql://postgres:***@localhost:5432/pagila
10 rows affected.

[('WONDERLAND CHRISTMAS', 'Hodeida', Decimal('1'), Decimal('10.99')),
 ('PATHS CONTROL', 'Yamuna Nagar', Decimal('1'), Decimal('10.99')),
 ('BRIGHT ENCOUNTERS', 'Allende', Decimal('1'), Decimal('10.99')),
 ('FLINTSTONES HAPPINESS', 'Baku', Decimal('1'), Decimal('10.99')),
 ('MAIDEN HOME', 'Purnea (Purnia)', Decimal('1'), Decimal('10.99')),
 ('DESERT POSEIDON', 'Sawhaj', Decimal('1'), Decimal('9.99')),
 ('GOODFELLAS SALUTE', 'Talavera', Decimal('1'), Decimal('9.99')),
 ('ELEPHANT TROJAN', 'al-Hawiya', Decimal('1'), Decimal('9.99')),
 ('FLINTSTONES HAPPINESS', 'Kolpino', Decimal('1'), Decimal('9.99')),
 ('HALL CASSIDY', 'Bag', Decimal('1'), Decimal('9.99'))]

# 4. Dimesional Modeling: Creating Facts & Dimensions

<img src="pagila-star.png" width="60%"/>

In [ ]:
%%sql

CREATE TABLE dimDate
(
  date_key integer NOT NULL PRIMARY KEY,
  date date NOT NULL,
  year smallint NOT NULL,
  quarter smallint NOT NULL,
  month smallint NOT NULL,
  day smallint NOT NULL,
  week smallint NOT NULL,
  is_weekend boolean
);

CREATE TABLE dimCustomer
(
  customer_key SERIAL PRIMARY KEY,
  customer_id  smallint NOT NULL,
  first_name   varchar(45) NOT NULL,
  last_name    varchar(45) NOT NULL,
  email        varchar(50),
  address      varchar(50) NOT NULL,
  address2     varchar(50),
  district     varchar(20) NOT NULL,
  city         varchar(50) NOT NULL,
  country      varchar(50) NOT NULL,
  postal_code  varchar(10),
  phone        varchar(20) NOT NULL,
  active       smallint NOT NULL,
  create_date  timestamp NOT NULL,
  start_date   date NOT NULL,
  end_date     date NOT NULL
);

CREATE TABLE dimMovie
(
  movie_key          SERIAL PRIMARY KEY,
  film_id            smallint NOT NULL,
  title              varchar(255) NOT NULL,
  description        text,
  release_year       year,
  language           varchar(20) NOT NULL,
  original_language  varchar(20),
  rental_duration    smallint NOT NULL,
  length             smallint NOT NULL,
  rating             varchar(5) NOT NULL,
  special_features   varchar(60) NOT NULL
);
CREATE TABLE dimStore
(
  store_key           SERIAL PRIMARY KEY,
  store_id            smallint NOT NULL,
  address             varchar(50) NOT NULL,
  address2            varchar(50),
  district            varchar(20) NOT NULL,
  city                varchar(50) NOT NULL,
  country             varchar(50) NOT NULL,
  postal_code         varchar(10),
  manager_first_name  varchar(45) NOT NULL,
  manager_last_name   varchar(45) NOT NULL,
  start_date          date NOT NULL,
  end_date            date NOT NULL
);
CREATE TABLE factSales
(
  sales_key        SERIAL PRIMARY KEY,
  date_key         INT NOT NULL REFERENCES dimDate(date_key),
  customer_key     INT NOT NULL REFERENCES dimCustomer(customer_key),
  movie_key        INT NOT NULL REFERENCES dimMovie(movie_key),
  store_key        INT NOT NULL REFERENCES dimStore(store_key),
  sales_amount     decimal(5,2) NOT NULL
);

In [19]:
%%sql
SELECT column_name, data_type
FROM information_schema.columns
WHERE table_name   = 'dimdate'

 * postgresql://postgres:***@localhost:5432/pagila
8 rows affected.

[('date_key', 'integer'),
 ('date', 'date'),
 ('year', 'smallint'),
 ('quarter', 'smallint'),
 ('month', 'smallint'),
 ('day', 'smallint'),
 ('week', 'smallint'),
 ('is_weekend', 'boolean')]

# STEP 5: ETL the data from 3NF tables to Facts & Dimension Tables

In this section, we populate the tables in the Star schema. We **extract** data from the normalized database, **transform** it, and **load** it into the new tables.

We load data from `paymment.payment_date`, transform it to extract date parts from the `payment_date` variable and load it into the `dimDate` table.

In [21]:
%%sql
INSERT INTO dimDate (date_key, date, year, quarter, month, day, week, is_weekend)
SELECT DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer) AS date_key,
       date(payment_date)                                           AS date,
       EXTRACT(year FROM payment_date)                              AS year,
       EXTRACT(quarter FROM payment_date)                           AS quarter,
       EXTRACT(month FROM payment_date)                             AS month,
       EXTRACT(day FROM payment_date)                               AS day,
       EXTRACT(week FROM payment_date)                              AS week,
       CASE WHEN EXTRACT(ISODOW FROM payment_date) IN (6, 7) THEN true ELSE false END AS is_weekend
FROM payment;

 * postgresql://postgres:***@localhost:5432/pagila
(psycopg2.errors.UniqueViolation) duplicate key value violates unique constraint "dimdate_pkey"
DETAIL:  Key (date_key)=(20220525) already exists.

[SQL: INSERT INTO dimDate (date_key, date, year, quarter, month, day, week, is_weekend)
SELECT DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer) AS date_key,
       date(payment_date)                                           AS date,
       EXTRACT(year FROM payment_date)                              AS year,
       EXTRACT(quarter FROM payment_date)                           AS quarter,
       EXTRACT(month FROM payment_date)                             AS month,
       EXTRACT(day FROM payment_date)                               AS day,
       EXTRACT(week FROM payment_date)                              AS week,
       CASE WHEN EXTRACT(ISODOW FROM payment_date) IN (6, 7) THEN true ELSE false END AS is_weekend
FROM payment;]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [23]:
%%sql
SELECT * FROM dimDate LIMIT 5;

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.

[(20220525, datetime.date(2022, 5, 25), 2022, 2, 5, 25, 21, False),
 (20220327, datetime.date(2022, 3, 27), 2022, 1, 3, 27, 12, True),
 (20220126, datetime.date(2022, 1, 26), 2022, 1, 1, 26, 4, False),
 (20220331, datetime.date(2022, 3, 31), 2022, 1, 3, 31, 13, False),
 (20220210, datetime.date(2022, 2, 10), 2022, 1, 2, 10, 6, False)]

In [22]:
%%sql

INSERT INTO dimCustomer (customer_key, customer_id, first_name, last_name, email, address, address2, district, city, country, postal_code, phone, active, create_date, start_date, end_date)
SELECT c.customer_id AS customer_key,
       c.customer_id,
       c.first_name,
       c.last_name,
       c.email,
       a.address,
       a.address2,
       a.district,
       ci.city,
       co.country,
       a.postal_code,
       a.phone,
       c.active,
       c.create_date,
       now()         AS start_date,
       now()         AS end_date
FROM customer c
JOIN address a  ON (c.address_id = a.address_id)
JOIN city ci    ON (a.city_id = ci.city_id)
JOIN country co ON (ci.country_id = co.country_id);

INSERT INTO dimMovie (movie_key, film_id, title, description, release_year, language, original_language, rental_duration, length, rating, special_features)
SELECT f.film_id      AS movie_key,
       f.film_id,
       f.title,
       f.description,
       f.release_year,
       l.name         AS language,
       orig_lang.name AS original_language,
       f.rental_duration,
       f.length,
       f.rating,
       f.special_features
FROM film f
JOIN language l              ON (f.language_id=l.language_id)
LEFT JOIN language orig_lang ON (f.original_language_id = orig_lang.language_id);

INSERT INTO dimStore (store_key, store_id, address, address2, district, city, country, postal_code, manager_first_name, manager_last_name, start_date, end_date)
SELECT s.store_id    AS store_key,
       s.store_id,
       a.address,
       a.address2,
       a.district,
       c.city,
       co.country,
       a.postal_code,
       st.first_name AS manager_first_name,
       st.last_name  AS manager_last_name,
       now()         AS start_date,
       now()         AS end_date
FROM store s
JOIN staff st   ON (s.manager_staff_id = st.staff_id)
JOIN address a  ON (s.address_id = a.address_id)
JOIN city c     ON (a.city_id = c.city_id)
JOIN country co ON (c.country_id = co.country_id);

INSERT INTO factSales (date_key, customer_key, movie_key, store_key, sales_amount)
SELECT TO_CHAR(p.payment_date :: DATE, 'yyyyMMDD')::integer AS date_key ,
       p.customer_id                                        AS customer_key,
       i.film_id                                            AS movie_key,
       i.store_id                                           AS store_key,
       p.amount                                             AS sales_amount
FROM payment p
JOIN rental r    ON ( p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id );

 * postgresql://postgres:***@localhost:5432/pagila
599 rows affected.
1000 rows affected.
500 rows affected.
16049 rows affected.

[]

In [24]:
%%sql
SELECT * FROM dimCUstomer LIMIT 5;

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.

[(1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', '1913 Hanoi Way', '', 'Nagasaki', 'Sasebo', 'Japan', '35200', '28303384290', 1, datetime.datetime(2022, 2, 14, 0, 0), datetime.date(2025, 8, 7), datetime.date(2025, 8, 7)),
 (2, 2, 'PATRICIA', 'JOHNSON', 'PATRICIA.JOHNSON@sakilacustomer.org', '1121 Loja Avenue', '', 'California', 'San Bernardino', 'United States', '17886', '838635286649', 1, datetime.datetime(2022, 2, 14, 0, 0), datetime.date(2025, 8, 7), datetime.date(2025, 8, 7)),
 (3, 3, 'LINDA', 'WILLIAMS', 'LINDA.WILLIAMS@sakilacustomer.org', '692 Joliet Street', '', 'Attika', 'Athenai', 'Greece', '83579', '448477190408', 1, datetime.datetime(2022, 2, 14, 0, 0), datetime.date(2025, 8, 7), datetime.date(2025, 8, 7)),
 (4, 4, 'BARBARA', 'JONES', 'BARBARA.JONES@sakilacustomer.org', '1566 Inegl Manor', '', 'Mandalay', 'Myingyan', 'Myanmar', '53561', '705814003527', 1, datetime.datetime(2022, 2, 14, 0, 0), datetime.date(2025, 8, 7), datetime.date(2025, 8, 7)),
 (5, 5, 'ELIZABETH', 'BROWN', 'ELIZABETH.BROWN@sakilacustomer.org', '53 Idfu Parkway', '', 'Nantou', 'Nantou', 'Taiwan', '42399', '10655648674', 1, datetime.datetime(2022, 2, 14, 0, 0), datetime.date(2025, 8, 7), datetime.date(2025, 8, 7))]

In [25]:
%%sql
SELECT * FROM factsales LIMIT 5;

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.

[(1, 20220128, 269, 651, 1, Decimal('0.99')),
 (2, 20220125, 274, 138, 1, Decimal('2.99')),
 (3, 20220127, 297, 186, 1, Decimal('0.99')),
 (4, 20220130, 344, 197, 1, Decimal('2.99')),
 (5, 20220126, 348, 741, 2, Decimal('0.99'))]

# STEP 6: Repeat the computation from the facts & dimension table

## 6.1 Facts Table has all the needed dimensions, no need for deep joins

In [27]:
%%time
%%sql
SELECT movie_key, date_key, customer_key, sales_amount
FROM factSales 
limit 5;

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.
CPU times: user 2.6 ms, sys: 1.4 ms, total: 3.99 ms
Wall time: 3.11 ms

## 6.2 Join fact table with dimensions to replace keys with attributes

In [29]:
%%sql
SELECT dimMovie.title, dimDate.month, dimCustomer.city, sales_amount
FROM factSales 
JOIN dimMovie on (dimMovie.movie_key = factSales.movie_key)
JOIN dimDate on (dimDate.date_key = factSales.date_key)
JOIN dimCustomer on (dimCustomer.customer_key = factSales.customer_key)
limit 5;

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.

[('PACKER MADIGAN', 1, 'Salinas', Decimal('0.99')),
 ('CHARIOTS CONSPIRACY', 1, 'Karnal', Decimal('2.99')),
 ('CRAFT OUTFIELD', 1, 'Ahmadnagar', Decimal('0.99')),
 ('CRUSADE HONEY', 1, 'Nukualofa', Decimal('2.99')),
 ('ROMAN PUNK', 1, 'Hsichuh', Decimal('0.99'))]

In [36]:
%%time
%%sql
SELECT dimMovie.title, dimDate.month, dimCustomer.city, sum(sales_amount) as revenue
FROM factSales 
JOIN dimMovie    on (dimMovie.movie_key      = factSales.movie_key)
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimCustomer on (dimCustomer.customer_key = factSales.customer_key)
group by (dimMovie.title, dimDate.month, dimCustomer.city)
order by revenue desc
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/pagila
10 rows affected.
CPU times: user 2.86 ms, sys: 1.42 ms, total: 4.28 ms
Wall time: 34.8 ms

In [37]:
%%time
%%sql
SELECT f.title, EXTRACT(month FROM p.payment_date) as month, ci.city, sum(p.amount) as revenue
FROM payment p
JOIN rental r    ON ( p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id )
JOIN film f ON ( i.film_id = f.film_id)
JOIN customer c  ON ( p.customer_id = c.customer_id )
JOIN address a ON ( c.address_id = a.address_id )
JOIN city ci ON ( a.city_id = ci.city_id )
group by (f.title, month, ci.city)
ORDER BY revenue desc
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/pagila
10 rows affected.
CPU times: user 3.3 ms, sys: 1.29 ms, total: 4.59 ms
Wall time: 44.7 ms

# Conclusion

- We were able to show that a start schema is easier to understand 
- Evidence that is more performant